{
  "Aries": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "Positive thinking can change the world, and you could do with some today. No matter how tough the going gets, take it in your stride, says Ganesha. If you think you can do it, you will. You have the magic touch today to initiate a new business strategy.",
      "sunsign": "Aries"
    },
    "week": {
      "horoscope": "This week may prove great for your career and business. Your seniors will appreciate your dedication towards work. It is advisable for businessmen to be cautious during the first half of this week. This week would be full of joyous moments for your relationships. You may have an amazing time with your family members; though a shift in your partner’s behavior may disappoint you. Students may find this week really positive. You may join some online or part time learning courses during this week to increase your knowledge. For your health, you are advised to maintain a healthy diet. There are chances of stomach disorders or gastric problems during this time. This week may ask you to be responsible about your finances and maintain a balance between income and expenditures.",
      "sunsign": "Aries",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Mar 21 - Apr 20",
      "current_date": "July 15, 2020",
      "description": "Don't try and force your thoughts into a pattern if there isn't one -- that could end up just confusing you more than helping! Instead, learn to live with the confusion for now. You'll get some clarity before too long.",
      "compatibility": "Leo",
      "mood": "Creative",
      "color": "Purple",
      "lucky_number": "95",
      "lucky_time": "1pm"
    }
  },
  "Taurus": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "Today is a perfect day to relax and enjoy your health, feels Ganesha. However, precaution should be the buzzword while dealing in money matters. You may develop a new interest in jewellers, artists, bankers and orators. Dinner will be laced with all the deserving delicacies of a hearty meal.",
      "sunsign": "Taurus"
    },
    "week": {
      "horoscope": "You will get amazing opportunities of growth for your career and business. Your dedication at your job would be appreciated by your seniors; you will even get a higher position. Businessmen will focus on expanding their businesses. This week may prove amazing for your studies. You will focus on learning new things; your indulgence and performance in extracurricular activities would be high as well. For your finances, you may have good times. Your sources of income may witness a hike. You may also get your stuck money back. You and your loved one may spend great quality time during this week; your bond would also get stronger in the process. Your health may support you; you will feel enthusiastic and energetic.",
      "sunsign": "Taurus",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Apr 21 - May 20",
      "current_date": "July 15, 2020",
      "description": "You've never been shy, but at the moment, you'll not only be outgoing ... well, let's just say that if you don't make a serious effort to tone it down a notch or two, you might be just a tad too primed for prime-time.",
      "compatibility": "Leo",
      "mood": "Energetic",
      "color": "Navy Blue",
      "lucky_number": "29",
      "lucky_time": "12pm"
    }
  },
  "Gemini": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "Today, your house gets a facelift — a new rug, matching cushion covers, or a brand new kitchen. This will take up most of your time. First, you will be busy furnishing and setting up your home, and then you will spend your time flaunting it to your friends, relatives, neighbours, bosses, colleagues, acquaintances.",
      "sunsign": "Gemini"
    },
    "week": {
      "horoscope": "Your career would be all set to move forward, and you may get many great opportunities during this week. You may also expand your business. If you want to get a transfer, this week may prove beneficial for you. You are likely to incur expenses after luxurious things. You should give proper attention to financial planning. You may focus on maintaining your mental and physical health. It is advisable for you to get regular medical checkups done nonetheless.. During this week, you will have to be cautious about your relationship as there can be differences of opinion between you and your loved one. You may feel anxious about your children’s progress during this week. Students may be inclined towards researching mysterious subjects.",
      "sunsign": "Gemini",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "May 21 - Jun 21",
      "current_date": "July 15, 2020",
      "description": "Your antennae are telling you that this is the calm before the storm, and that you'd better take advantage of it. Even if there's not a cloud in sight, have some fun anyway. Take an umbrella along, though -- just in case.",
      "compatibility": "Aquarius",
      "mood": "Cautious",
      "color": "Orchid",
      "lucky_number": "86",
      "lucky_time": "3am"
    }
  },
  "Cancer": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "You are known for your ability to set the ball rolling. Once you set your mind to do something, it is generally considered done by your peers. Today, you are eyeing a few accomplishments on the monetary front. Most part of your day will go in dealing with financial transactions, and importing and exporting goods.",
      "sunsign": "Cancer"
    },
    "week": {
      "horoscope": "You may express yourself well during this time, and your communication skills would be appreciated. For discussing or showcasing your innovative ideas to your clients or associates, this week may favour you. You may witness a few ups and downs in your academics during this week. You may feel distracted from your studies at the beginning of this week; though the last two days of this week would prove really beneficial for you. This period may help you in setting the foundation of your future. You may get good support from people around you. During this week, your emotional attachment with your partner would increase. For your health, this week would favour you. You will be physically fit.",
      "sunsign": "Cancer",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Jun 22 - Jul 22",
      "current_date": "July 15, 2020",
      "description": "Group efforts get you where you need to go a lot quicker than solo runs. Find some like-minded individuals to join you in your current endeavors, and you'll find that everything magically comes together.",
      "compatibility": "Virgo",
      "mood": "Collaborative",
      "color": "Teal",
      "lucky_number": "65",
      "lucky_time": "6pm"
    }
  },
  "Leo": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "Some people have the world at their feet. And today, you are one of them, says Ganesha. With your gorgeous appearance and gregarious attitude, it is easy for you to open all doors with just a touch. So, you have the luxury to choose — either you entertain yourself through multiple avenues such as movies, theatre and music, or you be the entertainer with your superior performing skills. But irrespective of what you decide to do, you shall excel in both, confirms Ganesha.",
      "sunsign": "Leo"
    },
    "week": {
      "horoscope": "Your career would reach new heights of success during this week. You may resolve your existing problems as well. Your seniors may provide you with great support. There are chances of you suffering from cold and cough during this time; thus you will have to be cautious. It is recommended for you to do Yoga and Pranayama in order to feel cheerful. You may get amazing support from your partner during this week. If single, you may succeed in finding your ideal life partner. If you want to initiate a new relationship, you should think twice before making any decisions. If you plan on appearing for medical examinations, you will pass with flying colours. You may feel interested in extracurricular activities. Your financial condition would be great this week. However, it is recommended that you stick to your budget or you may face financial constraints.",
      "sunsign": "Leo",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Jul 23 - Aug 22",
      "current_date": "July 15, 2020",
      "description": "You're fed up with compromise and having to decide everything by committee, but if you let yourself go and trust in the process, you might find some unexpected pockets of delight. Move from moment to moment, and everything will be fine.",
      "compatibility": "Virgo",
      "mood": "Mellow",
      "color": "Teal",
      "lucky_number": "74",
      "lucky_time": "3pm"
    }
  },
  "Virgo": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "A shadow grows large in your mind today. An unknown fear will haunt your day, warns Ganesha. But be ready to take a hike. You are most likely to end up spending on your foreign associates. Be careful of those expenses, says Ganesha.",
      "sunsign": "Virgo"
    },
    "week": {
      "horoscope": "This week may be tricky in terms of meeting deadlines at work. Though, with time you will be able to complete all your tasks efficiently. As a student, you will work extremely hard for your exams, however, the results may not live up to your expectations. You may face a lot of ups and downs during this week. This week may provide you with average results for your finance. The last three days of the week would be great for you. You may even incur expenses for improving your lifestyle. This week may prove great for your love and relationship. You are likely to get closer to your partner during this phase. This week would be quite average for you in terms of health. You are advised to do regular exercise in order to maintain your health and fitness during this period.",
      "sunsign": "Virgo",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Aug 23 - Sep 22",
      "current_date": "July 15, 2020",
      "description": "Whether you're ordinarily fond of change or not, this is one of those times when, oddly enough, you'll find yourself enjoying it. Sure, it might be because you've arranged it, but it's still a step in the right direction.",
      "compatibility": "Scorpio",
      "mood": "Hopeful",
      "color": "Copper",
      "lucky_number": "3",
      "lucky_time": "11am"
    }
  },
  "Libra": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "It's a day of reaching new heights when it comes to finances. The cosmos favours moneylenders and stock marketeers. Call it the special touch that you give to all transactions monetary, but today you have the uncanny knack of raking in the moolah from all sources. Sit back and see your tenacity multiply your fortunes, says Ganesha.",
      "sunsign": "Libra"
    },
    "week": {
      "horoscope": "On the family front, you can expect your family members to spend more time with you. While everything seems to be going well on the work front, try spending time with your loved ones as they too require your love and attention. Gifts also seem to be part and parcel of life this week. As the money shall keep flowing this week, you are advised to make some investments for your family members as well. It would be good to channelize all your finances and invest them for a secured future. This week also sees businessmen reaping profits off their ventures.",
      "sunsign": "Libra",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Sep 23 - Oct 22",
      "current_date": "July 15, 2020",
      "description": "If you've got some repairs to do, or have done by a professional, this would definitely be a great time to take care of it. If need be, take someone along who's wiser in this department than yourself.",
      "compatibility": "Gemini",
      "mood": "Collaborative",
      "color": "Orange",
      "lucky_number": "99",
      "lucky_time": "10am"
    }
  },
  "Scorpio": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "It's the same old rut today, says Ganesha. Nothing new, nothing exciting. People from the opposite sex, however, may bring you out of the routine and try to enliven your spirits, predicts Ganesha.",
      "sunsign": "Scorpio"
    },
    "week": {
      "horoscope": "Your efforts for your career or business will deliver positive results this week. Such results will keep you encouraged to progress. As an employee, you will be appreciated for your efforts. However, it would be wise to have the patience for the desired financial benefits. You must remain careful about your financial planning to avoid any kind of stress in the future. Such careful planning will be beneficial to manage your finances. You may try to expand your business. These connections will create a positive impact in the near future. Your busy schedule may raise some conflicts between you and your partner. This week, you must pay serious attention to your health. Make sure you take your medications regularly. Also, it would help to spend time in a safe and less polluted environment.",
      "sunsign": "Scorpio",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Oct 23 - Nov 22",
      "current_date": "July 15, 2020",
      "description": "Laughing this one off might be exactly the wrong tactic to take. Even though the situation looks silly or small, give it a second glance before you decide that it's not worth your attention. Little things can mushroom out of control.",
      "compatibility": "Pisces",
      "mood": "Focus",
      "color": "Teal",
      "lucky_number": "34",
      "lucky_time": "9pm"
    }
  },
  "Sagittarius": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "Those around you will be impressed by the leader in you. You are the general and others will rally at your call to arms. And all the while, you swing your sword and make your way to the top, defying all odds. Do not forget to let people have their own time and space. This will not only help you progress, but will boost their morale too.",
      "sunsign": "Sagittarius"
    },
    "week": {
      "horoscope": "A good week for singles to engage in a new relationship. Committed ones would be compelled to make major changes in their relationship. Too much of personal demands may weigh you down this week. Income will be good this week. Start saving money for future expenses. You may spend a lot behind luxuries and unnecessary things. You will be able to pay off your old loans and debts. Investing in a property will be ideal. Professionals who want to change jobs can do so this week. You may come by new opportunities and offers this week. You will earn more profits and be involved in dealing with overseas partners. A good week for branching out into new areas of businesses.",
      "sunsign": "Sagittarius",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Nov 23 - Dec 21",
      "current_date": "July 15, 2020",
      "description": "You're torn between flopping on the couch and channel-surfing for hours and ... well, taking a nap. Ignore both those impulses and get on your feet. Even picking up around the house will give you some much-needed exercise.",
      "compatibility": "Taurus",
      "mood": "Relaxed",
      "color": "Teal",
      "lucky_number": "97",
      "lucky_time": "8pm"
    }
  },
  "Capricorn": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "The journey from defeat to success is driven by optimism. You will be very optimistic today —about your work, future and everything that can lead you to success, says Ganesha. You will also be very careful while dealing with day-to-day work, and will capitalise on every opportunity that can get you a step closer to your goals. Determination and good luck is all you need to realise your dreams; you will have both today.",
      "sunsign": "Capricorn"
    },
    "week": {
      "horoscope": "You will have a comfortable week with your family. Love and understanding from older adults will give you joy and inner peace. Hangouts with friends and siblings may happen. Misunderstandings will be resolved by mid-week, and your partner will become very emotional and positive. Your love life will be progressive around the weekend. Your earning and expenditure will be the same. Plan a weekly budget. Avoid getting involved in taking shortcuts when it comes to investing money. Lack of support from your colleagues will result in stress. An apt week for business expansion. A good week for artists and singers. Marketing or sales people may feel disappointed for not achieving their target. A foreign colaboration will reap financial benefits.",
      "sunsign": "Capricorn",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Dec 22 - Jan 19",
      "current_date": "July 15, 2020",
      "description": "All puns aside that refer to your love of and talent for drama, life will be a celebratory cast party now, complete with toasts, pats on the back from all parties concerned and even some media coverage.",
      "compatibility": "Libra",
      "mood": "Sweet",
      "color": "Pink",
      "lucky_number": "56",
      "lucky_time": "10pm"
    }
  },
  "Aquarius": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "Things barely move today. But just like the proverbial tortoise, you seem to be winning the race, for many opportunities will come your way. There won't be any cash crunch, so you needn't lose sleep over that, says Ganesha.",
      "sunsign": "Aquarius"
    },
    "week": {
      "horoscope": "[\"For couples, the week ahead may cause some miscommunication and misunderstanding between you and your partner. The first five days are favourable for relationships. New love may blossom, and bonds may get stronger. There are chances some disturbances may arise with older members of your family; hence, take extra care while dealing with them. On a financial note, if you are looking for more income, forget shortcuts and put some extra effort. Don't delay your payments as it may cause stress later this week. Investments this week are not recommended. Try to maintain your expenditure and savings as both will go parallel. A wish for a transfer may come true this week. You may give fierce competition to your colleagues.\"]",
      "sunsign": "Aquarius",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Jan 20 - Feb 18",
      "current_date": "July 15, 2020",
      "description": "You'll be offered new responsibilities by a higher-up who's had their eye on you for some time. The opportunity will be tempting, financially and professionally, but it still wouldn't hurt to read the fine print carefully before you agree.",
      "compatibility": "Aries",
      "mood": "Serious",
      "color": "Orange",
      "lucky_number": "61",
      "lucky_time": "3pm"
    }
  },
  "Pisces": {
    "today": {
      "date": "2020-07-15",
      "horoscope": "The focus will be on children today, says Ganesha. While they will be the cause of an unfair share of your headache, you will be surprised at their ability to step up to the occasion, with just a little amount of coaching.",
      "sunsign": "Pisces"
    },
    "week": {
      "horoscope": "This week may be tricky in terms of your personal life. Disturbances in your marriage may occur. However, you will get support from friends. On the work front, communication with subordinates will be good. Employees must learn to save money. Unwanted expenditures may occur. You will have to buy an expensive gift for your beloved to keep your relationship stable. Businessmen will spend money to keep their loved ones happy. You can expect great appreciation and recognition at work as an employee. Export and import businesses will be financially safe. A good week for financial consultants. Teachers and professors will get public appreciation.",
      "sunsign": "Pisces",
      "week": "12-07-2020 - 18-07-2020"
    },
    "specialAPI": {
      "date_range": "Feb 19 - Mar 20",
      "current_date": "July 15, 2020",
      "description": "While you normally don't shy away from showing someone how sharply you can sting, minor altercations could become much bigger under the day's celestial influences. So sidestep any conflict, and you'll be far better off.",
      "compatibility": "Aries",
      "mood": "Responsible",
      "color": "Orchid",
      "lucky_number": "14",
      "lucky_time": "10am"
    }
  }
}
